_posts/2016-03-27-how-to-solve-polya.html
---
layout: post
title: "How to solve it by G. Polya"
date: 2016-03-27
comments: true
books: true
tags: books
excerpt: Thoughts and notes regarding Polya's how to solve it book.
---

<p>
<b>Polya</b> goes into great depths of revealing the intrinsic notions of
heuristics and analogy and the role they played in solving problems of
mathematical and non mathematical nature. In this journey <b>Polya</b>
wanted to remind us that asking the right questions is even more
important than the solution itself. According to <b>Polya</b> there are 4
steps we should follow in order to solve our problems:
</p>

<ol class="org-ol">
<li>Understanding the problem</li>
</ol>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">What is the unknown?</td>
</tr>

<tr>
<td class="org-left">To understand the problem ask questions.</td>
<td class="org-left">What are the data?</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">What is the condition?</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Is it possible to satisfy the condition?</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Is the condition sufficient to determine the unknown?</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Or is it insufficient?</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Or redundant?</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Or contradictory?</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Draw a figure</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Introduce suitable notation</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Separate the various parts of the condition</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Can you write them down?</td>
</tr>
</tbody>
</table>

<ol class="org-ol">
<li>Devising a plan</li>
</ol>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Find the connection between the data and the unknown.</td>
<td class="org-left">Have you seen it before?</td>
</tr>

<tr>
<td class="org-left">Consider auxiliary problems if an immediate connection</td>
<td class="org-left">Or have you seen the same problem in a slightly different form?</td>
</tr>

<tr>
<td class="org-left">cannot be found.</td>
<td class="org-left"><i>Do you know a related problem</i>?</td>
</tr>

<tr>
<td class="org-left">Eventually obtain a plan of the solution.</td>
<td class="org-left">Do you know a theorem that could be useful?</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><i>Look at the unknown</i>? And try to think of a familiar problem having the same or a similar unknown.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Here is a problem related to yours and solved before. Could you use it?</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Could you use its result?</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Could you use its method?</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Should you introduce some auxiliary element in order to make its use possible?</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Could you restate the problem?</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Could you restate it still differently?</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Go back to definitions.</td>
</tr>
</tbody>
</table>

<ol class="org-ol">
<li>Carrying out the plan</li>
</ol>


<ol class="org-ol">
<li>Looking back</li>
</ol>
